In [18]:
# Import the Pandas dependency.
import pandas as pd


# Read the contacts string data into a Pandas DataFrame
contacts_string_df = pd.read_csv("/Users/arashyousefi/Desktop/Analysis Project/Module-8/Crowdfunding-ETL/contacts_string_data.csv")
contacts_string_df.head()

                                        contact_info
0  contact_id 4661 name Cecilia Velasco email cec...
1  contact_id 3765 name Mariana Ellis email maria...
2  contact_id 4187 name Sofie Woods email sofie.w...
3  contact_id 4941 name Jeanette Iannotti email j...
4  contact_id 2199 name Samuel Sorgatz email samu...

In [19]:
# Extract the four-digit contact ID number.
contacts_string_df['contact_id'] = contacts_string_df['contact_info'].str.extract(r'(\d{4})')

In [20]:
contacts_string_df.head()

                                        contact_info contact_id
0  contact_id 4661 name Cecilia Velasco email cec...       4661
1  contact_id 3765 name Mariana Ellis email maria...       3765
2  contact_id 4187 name Sofie Woods email sofie.w...       4187
3  contact_id 4941 name Jeanette Iannotti email j...       4941
4  contact_id 2199 name Samuel Sorgatz email samu...       2199

In [21]:
# Extract the first and last name after the word "name". 
name = re.findall(r'([^name\s+][A-Za-z]+\s+[A-Za-z]+)', string_data)
name

NameError: name 'string_data' is not defined

In [39]:
import pandas as pd

# create a sample data frame
df = pd.DataFrame({'backer_id': ['av166', 'ha127', 'lg794', 'tb566', 'lh506'], 
                   'cf_id': [968, 563, 65, 563, 563], 
                   'first_name': ['Angelo', 'Hubert', 'Loris', 'Teodora', 'Lexie'], 
                   'last_name': ['Vincent', 'Arnold', 'Goulet', 'Brunelli', 'Hunt'], 
                   'email': ['avincent@live.com', 'harnold@yandex.com', 'lgoulet@yandex.com', 'tbrunelli@outlook.com', 'lhunt@live.com']})

# remove the index
df

  backer_id  cf_id first_name last_name                  email
0     av166    968     Angelo   Vincent      avincent@live.com
1     ha127    563     Hubert    Arnold     harnold@yandex.com
2     lg794     65      Loris    Goulet     lgoulet@yandex.com
3     tb566    563    Teodora  Brunelli  tbrunelli@outlook.com
4     lh506    563      Lexie      Hunt         lhunt@live.com

In [40]:
df.drop(df.columns[0], axis=1, inplace=True)

In [41]:
df

   cf_id first_name last_name                  email
0    968     Angelo   Vincent      avincent@live.com
1    563     Hubert    Arnold     harnold@yandex.com
2     65      Loris    Goulet     lgoulet@yandex.com
3    563    Teodora  Brunelli  tbrunelli@outlook.com
4    563      Lexie      Hunt         lhunt@live.com